#include <stdio.h>

typedef union tagVar
{
	int i;
	float d;
}TV;

int main(void)
{
	TV V;

	V.i = 30;  //분명히 int는 30으로 선언.
	V.d = 4.4;

	printf("V.i = %d\n", V.i); //그런데 출력은.......
	printf("V.d = %.2f\n", V.d);  //그 이유는 공영체 V.d에 4.4를 대입하면서 int의 값이 중첩되었기 때문.

	/*
	  1000번지   1001   1002     1003
	 |------------------------------------------|
	 |                   i 변수                 |
	 |------------------------------------------|
	 |                   d 변수                 |
	 |------------------------------------------|
	*/
	return (0);
}
